---
title: HermiteFace
classe: Autodesk.Revit.DB.HermiteFace
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Face
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# HermiteFace

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `IList<XYZ> MixedDerivs { get; }` | `hermiteFace.MixedDerivs` | IList<XYZ> |
| `DoubleArray Params { get; }` | `hermiteFace.Params` | DoubleArray |
| `IList<XYZ> Points { get; }` | `hermiteFace.Points` | IList<XYZ> |
| `IList<XYZ> Tangents { get; }` | `hermiteFace.Tangents` | IList<XYZ> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```